{"maxCities":3,"pubclicIP":"20.132.6.254","geoIPData":{"country":"US","countryCode":"US","region":"","regionCode":"","city":"","postal":"","ip":"20.132.6.254","latitude":37.751,"longitude":-97.822,"timezone":""},"majorCities":[{"city":"new york","latitude":40.7141667,"longitude":-74.0063889,"weather":{"city":"new york","temp":297.44,"tempC":"24.29","tempF":"75.72","temp_min":294.82,"temp_minC":"21.67","temp_minF":"71.01","temp_maxC":"24.29","temp_maxF":"75.72","temp_max":299.82,"desc":["haze"]}},{"city":"los angeles","latitude":34.0522222,"longitude":-118.2427778,"weather":{"city":"los angeles","temp":290.87,"tempC":"17.72","tempF":"63.90","temp_min":288.15,"temp_minC":"15.00","temp_minF":"59.00","temp_maxC":"17.72","temp_maxF":"63.90","temp_max":292.59,"desc":["overcast clouds"]}},{"city":"chicago","latitude":41.85,"longitude":-87.65,"weather":{"city":"chicago","temp":295.15,"tempC":"22.00","tempF":"71.60","temp_min":292.59,"temp_minC":"19.44","temp_minF":"66.99","temp_maxC":"22.00","temp_maxF":"71.60","temp_max":297.04,"desc":["clear sky"]}}],"articles":[{"content":"Justin Verlander thinks balls are juiced, J.D. Martinez isn't so sure - WEEI It's a conversation that has been happening in clubhouses throughout Major League Baseball, albeit just not in boisterous tones.That changed Monday."},{"content":"Amy McGrath announces bid to take on Sen. Mitch McConnell in 2020 - CNN Kentucky Democrat Amy McGrath, a former fighter pilot who rose to national prominence last year in her failed campaign for Congress against Republican Andy Barr, is turning her sights on a new target: Senate Majority Leader Mitch McConnell."},{"content":"Jeffrey Epstein jailed: Victims speak out after billionaire financier charged with sex trafficking - CBS News Billionaire financier was charged Monday with sexually abusing dozens of underage girls"},{"content":"PepsiCo earnings top estimates on strong snack and beverage sales, backs 2019 forecast - CNBC PepsiCo shares rose slightly Tuesday after the company's second-quarter earnings topped estimates, as healthier snacks and sparkling water helped fuel sales growth and offset a drag from foreign exchange."},{"content":"Zoom Mac flaw allows webcams to be hijacked - because they wanted to save you a click - Graham Cluley Security News If you have installed Zoom, any website can turn on your Mac’s webcam without asking your permission.\nOh, and if you’ve since uninstalled Zoom – that doesn’t fix the problem."},{"content":"He the North: Raptors Fans Reckon With Kawhi’s Exit - The Ringer Leonard gave the Raps their first NBA title, then broke hearts, leaving in free agency after one season. Now Toronto’s fan base sorts through the mixed emotions."},{"content":"5 ways to keep your Android apps from spying on you - CNET Over 1,000 Android apps grab your data even if you tell them no."},{"content":"Fans Can't Get Enough Of Pokémon Shield's Spooky New Gym Leader - Kotaku All of the new Gym Leader character designs for Pokémon Sword and Shield are great. One recently revealed Trainer, in particular, has been racking up the fan art. Say hello to Allister."},{"content":"Fed Chairman Jerome Powell’s Approach to Interest-Rate Policy Wins Bipartisan Backing - Wall Street Journal President Trump’s relentless public criticism of the man he picked to run the Federal Reserve, Jerome Powell, isn’t broadly shared by lawmakers who confirmed the central bank leader to his post last year."},{"content":"Civil Rights Activist James Reeb's Murder Might Have Been Solved Had FBI Shared - NPR Alabama officials tell NPR that if the FBI had shared its case file, they would have investigated the James Reeb murder case while one of the assailants was still alive."},{"content":"The Affordable Care Act Is Back In Court: 5 Facts You Need To Know - NPR The ACA is again being put to the test, after a lower court judge ruled the massive health law unconstitutional. The case might yet ricochet back to the Supreme Court ahead of the 2020 election."},{"content":"Taiwan-China tension mounts as US Trump admin proposes arms sale of Abrams tanks and Stinger missiles to Taipei - CBS News Beijing claims Taiwan as its territory, and has been making more overt military threats and trying to isolate the tiny, self-ruled island"},{"content":"Mets’ rookie Pete Alonso wins HR Derby, beats Vladimir Guerrero Jr for $1 million prize - Fox News Pete Alonso took one final swing and flipped his bat high in the air. Another walk-off."},{"content":"Stocks are dropping as traders fear a shift in the Fed's rate-cutting stance - Business Insider Stocks are dropping as traders fear a shift in the Fed's rate-cutting stance"},{"content":"A$AP Rocky Being Held in Inhumane Conditions in Swedish Jail - TMZ A$AP Rocky being held in inhumane conditions in Swedish jail."},{"content":"Deutsche Bank Investor Doubts Increase at Scale of Sewing Revamp - Bloomberg null"},{"content":"Exclusive: China's PLA signals it will keep Hong Kong-based troops in barracks - Reuters The Chinese military commander responsible for Hong Kong has assured a Pentagon official that Chinese troops will not interfere in the city's affairs – an apparent signal that they will stay in their barracks amid renewed political upheaval."},{"content":"Logitech G Pro X Gaming Headset Review: Luxurious Listening - Tom's Hardware Logitech’s G Pro X headset is a full package with great sound, customizable software and plenty of accessories."},{"content":"Hong Kong leader Carrie Lam says extradition bill 'dead' - Aljazeera.com Carrie Lam's climbdown comes as protesters vow more rallies to demand complete withdrawal of the controversial bill."},{"content":"Krause: Start them up - Itemlive - Daily Item Once upon a time, rock ‘n’ roll was a young person’s avocation. We listened to it as a way to thumb our noses at “the establishment.” There were songs, and lots of them, with hidden messages contained within the lyrics, known only to those of us fortunate eno…"}]}