{"maxCities":3,"pubclicIP":"109.48.51.199","geoIPData":{"country":"PT","countryCode":"PT","region":"Lisboa","regionCode":"","city":"Lisbon","postal":"1600","ip":"109.48.51.199","latitude":38.7167,"longitude":-9.1333,"timezone":""},"majorCities":[{"city":"lisbon","latitude":38.716667,"longitude":-9.133333,"weather":{"city":"lisbon","temp":298.34,"tempC":"25.19","tempF":"77.34","temp_min":294.82,"temp_minC":"21.67","temp_minF":"71.01","temp_maxC":"25.19","temp_maxF":"77.34","temp_max":301.48,"desc":["clear sky"]}},{"city":"porto","latitude":41.149606,"longitude":-8.610993,"weather":{"city":"porto","temp":299.23,"tempC":"26.08","tempF":"78.94","temp_min":293.15,"temp_minC":"20.00","temp_minF":"68.00","temp_maxC":"26.08","temp_maxF":"78.94","temp_max":305.37,"desc":["clear sky"]}},{"city":"amadora","latitude":38.759711,"longitude":-9.239708,"weather":{"city":"amadora","temp":298.35,"tempC":"25.20","tempF":"77.36","temp_min":294.82,"temp_minC":"21.67","temp_minF":"71.01","temp_maxC":"25.20","temp_maxF":"77.36","temp_max":301.48,"desc":["clear sky"]}}],"articles":[{"content":"João Félix esteve bem» (Atlético Madrid) - A Bola A BOLA, toda a informação desportiva. Acompanhe todas as notícias do seu clube ou modalidade preferida, para onde quer que vá."},{"content":"André Villas-Boas: \"Tenho ideias e penso muito no meu clube, o FC Porto\" - SAPO Desporto Técnico de 41 anos assume que poderá regressar ao FC Porto no futuro como dirigente."},{"content":"Grandes reacendimentos em Vila de Rei e Sertã. Situação complicou-se na última hora - Expresso Há nove localidades nos concelhos de Vila de Rei, Sertã e Mação onde a situação é considerada mais complicada devido aos incêndios que também obrigaram ao corte de três estradas nacionais. A praia fluvial de Cardigos, em Mação, está a ser evacuada"},{"content":"Ronaldo não gostou de ser substituído e fez 'cara feia' a Sarri - Notícias ao Minuto Português começou como titular mas foi retirado de campo aos 63 minutos de jogo."},{"content":"Cláudia Vieira mostra barriguinha e fãs reagem: “Grávida linda” - A Televisão Cláudia Vieira exibiu, uma vez mais, a sua barriguinha de grávida e deixou os fãs deliciados. As mensagens de carinho foram muitas e há quem já se mostre…"},{"content":"Uma sandes, uma água e uma maçã... a comida dos heróis que combatem as chamas em Vila de Rei - Sol Este domingo, o bombeiro Fábio Manuel Pelica, um dos bombeiros que se encontra a combater as chamas em Vila de Rei, decidiu utilizar as redes sociais para desabafar, mostrar o seu almoço e mostrar a sua revolta para com a falta de reconhecimento da profissão."},{"content":"Incêndios: Marcelo visitou ferido no Hospital de São José e diz que \"situação está sob controlo\" - SAPO 24 O Presidente da República visitou hoje o civil ferido no incêndio de Vila de Rei que se encontra no Hospital de São José, em Lisboa, e disse à Lusa que \"a situação está sob controlo\"."},{"content":"Dia Mundial do Cérebro (22 de julho) | Prevenção primordial do AVC - Mais Algarve Artigo de Opinião da autoria de: Dr. Fernando Pita, coordenador da Unidade Funcional de Neurologia, Hospital de Cascais, membro da Sociedade Portuguesa do AVC.\r\nO AVC (de volta ao capítulo do sistema nervoso na 11º revisão do ICD após 62 anos de e..."},{"content":"Acidente na Segunda Circular faz um morto e um ferido grave - Sol Segundo declarações de uma fonte da PSP à Lusa, o acidente ocorreu por volta das 06:15 no sentido Lisboa-Sacavém da Segunda Circular."},{"content":"Sobe para 20 o número de feridos nos incêndios - TVI24 O balanço foi feito pelo ministro da Administração Interna, Eduardo Cabrita, na manhã deste domingo. O governante confirmou que em cerca de uma hora deflagraram \"cinco incêndios de dimensão significativa numa zona muito próxima\" O ministro disse que os órgãos…"},{"content":"Caras conhecidas encerram mais um Super Bock Super Rock - Notícias ao Minuto Terminou este sábado a edição que marcou o regresso do festival ao Meco."},{"content":"Ornatos Violeta triunfais no MEO Marés Vivas: três encores, uma versão e o amigo Carlão. Alinhamento e vídeos do concerto de Gaia - Blitz A banda do Porto deu perto de casa o segundo concerto da reunião de 2019. E tocou, precisamente, 'Casa' - a canção dos Da Weasel com Manel Cruz - numa noite longa com outras surpresas"},{"content":"“Nos Correios tenho de ser atendida na rua” - Correio da Manhã Elisabete movimenta-se em cadeira de rodas e lamenta falta de acessos nos serviços públicos."},{"content":"Dezenas de milhares de manifestantes nas ruas de Hong Kong - SAPO 24 Dezenas de milhares de manifestantes saíram hoje à rua em Hong Kong, para mais um protesto contra as emendas à lei da extradição, já suspensas, e o Governo da cidade."},{"content":"Premium Benfica um a um contra o Chivas: visão de Taarabt a acordar Seferovic - O Jogo UM A UM - Confira a avaliação feita por O JOGO aos jogadores do Benfica que defrontaram o Chivas na International Champions Cup. Águias venceram por três golos sem resposta."},{"content":"Aviso amarelo por tempo quente em sete distritos. Termómetros podem atingir os 38º este domingo - Correio da Manhã Aviso foi prolongado até à próxima terça-feira. Portugal vai enfrentar onda de calor."},{"content":"Partilha de veículos dá emprego a mais de 500 pessoas - Dinheiro Vivo Operadores de trotinetes empregam mais pessoas do que as empresas de partilha de carros e bicicletas. Vínculo laboral dos trabalhadores é variado."},{"content":"Skkrt skkrt! Os Migos armadilharam o Super Bock Super Rock - SAPO 24 Naquela que foi a sua estreia em Portugal, o trio rap norte-americano deu um espetáculo repleto de fumo, de chamas e de dança, perante uma audiência numerosa. Janelle Monáe apontou ao trono de rainha da pop, Masego fez chorar por mais e os Superorganism revel…"},{"content":"Estudo revela que 80% de diabéticos podem ter doenças cardiovasculares - Diário do Litoral Um estudo realizado pelo EndoDebate em parceria com a Revista Saúde, mostrou que 80% das pessoas com diabetes tipo 2 apresentam indícios de comprometimento cardiovascular. Mais da metade (52%) indicam pelo menos..."},{"content":"Trump e os ataques racistas - Sol Trump sobe fasquia de discurso de ódio para fins eleitorais e colar os democratas a um partido de esquerda «extremista»."}],"musicTracks":[{"trackUrl":"https://open.spotify.com/track/0TK2YIli7K1leLovkQiNik","trackImage":"https://i.scdn.co/image/b0d36f3a80a36960e34c04f21ba44e05ccf5991b","trackName":"Señorita","artist":"by Shawn Mendes"},{"trackUrl":"https://open.spotify.com/track/1f38Gx6xQz6r4H1jGVNBJo","trackImage":"https://i.scdn.co/image/3c3c59174f57dff95be07fc3496fe57097c65cfc","trackName":"Loco Contigo (with J. Balvin & Tyga)","artist":"by DJ Snake"},{"trackUrl":"https://open.spotify.com/track/2HDfbyb9LZStAYzyZK8Hld","trackImage":"https://i.scdn.co/image/a285d3014cc2d12c7d4be34a72b702a55e95651c","trackName":"Sentimento Safari","artist":"by Julinho Ksd"},{"trackUrl":"https://open.spotify.com/track/1ai9FDnFQDv18WAtFhMTIz","trackImage":"https://i.scdn.co/image/bca715bd64f341cc8b94d702b61c5f6c83a46010","trackName":"Bairro","artist":"by Wet Bed Gang"},{"trackUrl":"https://open.spotify.com/track/0hVXuCcriWRGvwMV1r5Yn9","trackImage":"https://i.scdn.co/image/fd4ef7987cbdd81124b1de291838282a03f05f9f","trackName":"I Don't Care (with Justin Bieber)","artist":"by Ed Sheeran"},{"trackUrl":"https://open.spotify.com/track/6u7jPi22kF8CTQ3rb9DHE7","trackImage":"https://i.scdn.co/image/394d581cef8d98be1884bfab8457e8581e800a8a","trackName":"Old Town Road - Remix","artist":"by Lil Nas X"},{"trackUrl":"https://open.spotify.com/track/5Ab6z7ZgBlzJaADQhwAYnj","trackImage":"https://i.scdn.co/image/beeaa8b1ce7ef0b48798ff0cf29f3d6f95fcc4bc","trackName":"1 de Abril","artist":"by Plutónio"},{"trackUrl":"https://open.spotify.com/track/6vBdBCoOhKHiYDDOcorfNo","trackImage":"https://i.scdn.co/image/5b447fae306902b0b11d87608aa61068cf1aee7e","trackName":"Goodbyes (Feat. Young Thug)","artist":"by Post Malone"},{"trackUrl":"https://open.spotify.com/track/70eFcWOvlMObDhURTqT4Fv","trackImage":"https://i.scdn.co/image/fd4ef7987cbdd81124b1de291838282a03f05f9f","trackName":"Beautiful People (feat. Khalid)","artist":"by Ed Sheeran"},{"trackUrl":"https://open.spotify.com/track/0PdCHtiX5w5P4W8NvLrUx2","trackImage":"https://i.scdn.co/image/ce90270ee9aa9fe1b3818295f200aa2866e73eb9","trackName":"Meu Deus","artist":"by Plutónio"},{"trackUrl":"https://open.spotify.com/track/3zZgldoV0dpsquQKqdi5hH","trackImage":"https://i.scdn.co/image/277bd6f7989b96ab21095a3c9298cef88b2dd127","trackName":"Com Licença","artist":"by Deejay Telio"},{"trackUrl":"https://open.spotify.com/track/7KbF6AdprOXEEHlsq11Z6d","trackImage":"https://i.scdn.co/image/2dbe6af89298c4216a46253aadf9f557b5832e8f","trackName":"11 PM","artist":"by Maluma"}]}