{"maxCities":3,"pubclicIP":"192.46.52.14","geoIPData":{"country":"IN","countryCode":"IN","region":"Karnataka","regionCode":"","city":"Bangalore","postal":"560009","ip":"192.46.52.14","latitude":12.9833,"longitude":77.5833,"timezone":""},"majorCities":[{"city":"bombay","latitude":18.975,"longitude":72.825833,"weather":{"city":"bombay","temp":298.36,"tempC":"25.21","tempF":"77.38","temp_min":297.59,"temp_minC":"24.44","temp_minF":"75.99","temp_maxC":"25.21","temp_maxF":"77.38","temp_max":299.15,"desc":["scattered clouds"]},"traffic":[]},{"city":"delhi","latitude":28.666667,"longitude":77.216667,"weather":{"city":"delhi","temp":307.06,"tempC":"33.91","tempF":"93.04","temp_min":304.26,"temp_minC":"31.11","temp_minF":"88.00","temp_maxC":"33.91","temp_maxF":"93.04","temp_max":309.15,"desc":["haze"]},"traffic":[]},{"city":"new delhi","latitude":28.6,"longitude":77.2,"weather":{"city":"new delhi","temp":307.07,"tempC":"33.92","tempF":"93.06","temp_min":304.26,"temp_minC":"31.11","temp_minF":"88.00","temp_maxC":"33.92","temp_maxF":"93.06","temp_max":309.15,"desc":["haze"]},"traffic":[]}],"articles":[{"content":"Karnataka Assembly Floor Test LIVE Updates: 2nd Love Letter Hurt Me, Says HDK after Guv Sets New 6pm Deadline - News18 Karnataka Assembly Live Updates: Governor Vajubhai Vala in the afternoon issued a second deadline to Chief Minister HD Kumaraswamy to complete the trust vote and decide the fate of the ruling Congress-Janata Dal (Secular) coalition in the state. Kumaraswamy h…"},{"content":"Karnataka crisis: Cong moves Supreme Court to seek clarity on use of whip - The News Minute Soon after the Karnataka Assembly missed the deadline of 1.30 pm on Friday for the trust vote to be held, Karnataka Pradesh Congress Committee chief Dinesh Gundu Rao moved the Supreme Court, seeking clarity on the issue of court’s exemption of party whip appl…"},{"content":"Vivo S1 with 32MP selfie camera and 4,500mAh battery is coming to Malaysia next week - SoyaCincau.com shares Facebook Twitter Google+ WhatsAppThe Vivo S1 is coming to Malaysia very soon and it is different from the one that’s sold in China. Unlike the Vivo V15 series, it doesn’t come with a pop-up selfie camera but it still retains a 32MP selfie shooter. The …"},{"content":"Why RBL Bank plunged over 13% despite posting 41% rise in Q1 profit - Economic Times Provisions and contingencies jumped 51.89 per cent YoY to Rs 213.18 crore in Q1."},{"content":"Parliament LIVE updates: Lok Sabha passes Protection of Human Rights (Amendment) bill after Opposition lodges strong protests - Firstpost Parliament LIVE updates: The Lok Sabha on Friday passed the Protection of Human Rights (Amendment) Bill, 2019 with the 'aye's having the majority.  Watch LIVE News, Latest Updates, Live blog, Highlights and Live coverage online at firstpost.com."},{"content":"Closing Bell: Indices end at 2-month low, Sensex sinks 560 pts, Nifty holds 11,400 - Moneycontrol.com All sectoral indices ended in red with Auto index falling 3 percent."},{"content":"BCCI stunned as CoA asks Virat Kohli and Ravi Shastri to decide on WAGs travel - Times of India Cricket News: The bizarre move by the Supreme Court-appointed CoA asking the India captain and coach to decide on travel schedule of the WAGs has not just taken the"},{"content":"Iran counters Trump, says US shot down its own drone `by mistake` - Zee News Irans statement came hours after the US President Donald Trump said that a US Navy ship had destroyed an Iranian drone in the Strait of Hormuz."},{"content":"Samsung launches Galaxy A80 in India with rotating triple camera and 8GB RAM - The News Minute Samsung India on Thursday refreshed its Galaxy A series with Galaxy A80 with the world's first rotating triple camera, priced at Rs 47,990. The Galaxy A80 has a 3,700 mAh battery and features Qualcomm Snapdragon 730G Octa-Core chipset, which is the Snapdragon…"},{"content":"Cuteness Alert: Taimur And Inaaya's London Reunion Pic Is Here To Make Your Weekend Better - NDTV News Nothing much to see here. Just Taimur and Inaaya on a playdate in London"},{"content":"\"India Can't Be Refugee Capital\": Centre To Top Court On Assam NRC List - NDTV News Lakhs of people have been wrongly included in the draft National Register of Citizens being prepared in Assam to weed out illegal immigrants, centre told the Supreme Court today, asking for more time to finalise the list. \"India can't be world's refugee capit…"},{"content":"Complete Babri Masjid demolition cases in 9 months, says Supreme Court - The Hindu A Bench led by Justice Rohinton Nariman extended the tenure of the Special Judge conducting the trial."},{"content":"Reliance Jio Becomes India's No. 2 Telecom Company, Bharti Airtel Third - NDTV News Jio has disrupted the telecom industry in the country since it was launched in 2016, offering cheap bundles and prompting shutdowns"},{"content":"PM invites suggestions for his Independence Day speech - Times of India India News: PM Narendra Modi has invited suggestions from people for his Independence Day speech, saying it will allow thoughts of the common man to be heard by t"},{"content":"Priyanka Chopra Flaunts Red Dress and Monogram Lipstick Bag Worth Rs 3 Lakh on Birthday - News18 Priyanka Chopra's birthday outfit is costly but her panache and smile make it totally priceless."},{"content":"Xiaomi Mi A3 vs Redmi K20 vs Redmi Note 7 Pro: Price, Specifications Compared - NDTV The newly launched Xiaomi Mi A3 is compared with the Redmi K20 and the Redmi Note 7 Pro to highlight all the differences between the three."},{"content":"Priyanka Gandhi detained on way to meet kin of firing victims in UP - Times of India India News: NEW DELHI: Congress general secretary Priyanka Gandhi Vadra was on Friday detained by the police in Uttar Pradesh and stopped from proceeding to Sonbh."},{"content":"Netflix faces stiff competition from local OTT players - The Hindu BusinessLine As per Boston Consulting estimates, India’s video-on-demand market is likely to grow to $5 billion by 2023 from $500 million last year."},{"content":"Pakistan lost over Rs 8 billion due to airspace closure: Report - Hindustan Times “It’s a huge loss for our overall (aviation) industry,” Pakistan Federal Minister for Aviation Ghulam Sarwar Khan said on Thursday."},{"content":"ICJ verdict in Kulbhushan Jadhav case is a call for introspection in power corridors of Pakistan - Firstpost null"}],"musicTracks":[{"trackUrl":"https://open.spotify.com/track/0TK2YIli7K1leLovkQiNik","trackImage":"https://i.scdn.co/image/b0d36f3a80a36960e34c04f21ba44e05ccf5991b","trackName":"Señorita","artist":"by Shawn Mendes"},{"trackUrl":"https://open.spotify.com/track/2Fv2injs4qAm8mJBGaxVKU","trackImage":"https://i.scdn.co/image/5a669683855f041bb59d6d881641d64a639d49e3","trackName":"Tujhe Kitna Chahne Lage (From \"Kabir Singh\")","artist":"by Arijit Singh"},{"trackUrl":"https://open.spotify.com/track/1feANd8EfcDP5UqSvbheM3","trackImage":"https://i.scdn.co/image/245a06acf872f72b2b84ba625c4cb1f6cb1955d1","trackName":"Bekhayali (From \"Kabir Singh\")","artist":"by Sachet Tandon"},{"trackUrl":"https://open.spotify.com/track/7ltu5scschhmNWp5rp8rVF","trackImage":"https://i.scdn.co/image/36639487d1e10e0699074a57b883d4f547c5167b","trackName":"Ve Maahi","artist":"by Arijit Singh"},{"trackUrl":"https://open.spotify.com/track/3oWxFNsXstcancCR1wODR4","trackImage":"https://i.scdn.co/image/0670bc97d011053c265b76841550375f8aac7057","trackName":"Tera Ban Jaunga","artist":"by Akhil Sachdeva"},{"trackUrl":"https://open.spotify.com/track/2IoZMG3RqiTmsy7Li3zGFg","trackImage":"https://i.scdn.co/image/4c13ae5eddf25a3a7e17fc0bff5cac2f16bbbae9","trackName":"Mere Sohneya (From \"Kabir Singh\")","artist":"by Sachet Tandon"},{"trackUrl":"https://open.spotify.com/track/3ZjMdVOWxQ53FKrmkgCv95","trackImage":"https://i.scdn.co/image/5b0377455095d8a405b3a46441cae7d453d07842","trackName":"Psycho Saiyaan (From \"Saaho\")","artist":"by Sachet Tandon"},{"trackUrl":"https://open.spotify.com/track/1y1rQTkWmrZdJmjwuK07GC","trackImage":"https://i.scdn.co/image/82645bab5b4386ab0e330c601580719ee36e4013","trackName":"Kaise Hua (From \"Kabir Singh\")","artist":"by Vishal Mishra"},{"trackUrl":"https://open.spotify.com/track/4cFwhwH5ydnHgB0Tv3lZsm","trackImage":"https://i.scdn.co/image/31e145912d04c123c9593761d9984e2b7247d96c","trackName":"O Saki Saki (From \"Batla House\")","artist":"by Neha Kakkar"},{"trackUrl":"https://open.spotify.com/track/2tjWCe2W7sgvS3C8NHcdtI","trackImage":"https://i.scdn.co/image/fd64ca9a1a5571690bbaf212eda8cba2bef8e666","trackName":"Duniyaa (From \"Luka Chuppi\")","artist":"by Akhil"},{"trackUrl":"https://open.spotify.com/track/6vBdBCoOhKHiYDDOcorfNo","trackImage":"https://i.scdn.co/image/5b447fae306902b0b11d87608aa61068cf1aee7e","trackName":"Goodbyes (Feat. Young Thug)","artist":"by Post Malone"},{"trackUrl":"https://open.spotify.com/track/6aPMWbbdhDhiJHlknZb9Yx","trackImage":"https://i.scdn.co/image/d72bc0acd2fca87e7a2a6e14d2e2731801418f98","trackName":"Bekhayali (Arijit Singh Version) [From \"Kabir Singh\"]","artist":"by Arijit Singh"}]}