{"maxCities":3,"pubclicIP":"109.48.51.199","geoIPData":{"country":"PT","countryCode":"PT","region":"Lisboa","regionCode":"","city":"Lisbon","postal":"1600","ip":"109.48.51.199","latitude":38.7167,"longitude":-9.1333,"timezone":""},"majorCities":[{"city":"lisbon","latitude":38.716667,"longitude":-9.133333,"weather":{"city":"lisbon","temp":298.89,"tempC":"25.74","tempF":"78.33","temp_min":293.71,"temp_minC":"20.56","temp_minF":"69.01","temp_maxC":"25.74","temp_maxF":"78.33","temp_max":302.59,"desc":["clear sky"]},"traffic":[["Está fechado entre Serra das Brancas e Alto dos Moinhos - Fechada devido a obras na estrada."],["Está fechado passado  - Fechada."],["Está fechado em Largo de São Carlos - Fechado devido a ocorrência grave."],["Está fechado entre Avenida 24 de Julho e Rua Dom Luís I - Fechada devido a obras na estrada."],["Em Calcada Da Quintinha - Ramal de entrada fechado. Obras de construção."],["Está fechado entre Rua de São Pedro de Alcântara e Rua da Conceição da Glória - Fechada devido a obras na estrada."],["Está fechado entre Rua Vasco da Gama Fernandes e Rua Luis Sá - Fechada devido a obras na estrada."]]},{"city":"porto","latitude":41.149606,"longitude":-8.610993,"weather":{"city":"porto","temp":293.19,"tempC":"20.04","tempF":"68.07","temp_min":292.15,"temp_minC":"19.00","temp_minF":"66.20","temp_maxC":"20.04","temp_maxF":"68.07","temp_max":293.71,"desc":["clear sky"]}},{"city":"amadora","latitude":38.759711,"longitude":-9.239708,"weather":{"city":"amadora","temp":299.18,"tempC":"26.03","tempF":"78.85","temp_min":293.71,"temp_minC":"20.56","temp_minF":"69.01","temp_maxC":"26.03","temp_maxF":"78.85","temp_max":303.15,"desc":["clear sky"]},"traffic":[["Está fechado entre Serra das Brancas e Alto dos Moinhos - Fechada devido a obras na estrada."],["Está fechado passado  - Fechada."],["Está fechado em Largo de São Carlos - Fechado devido a ocorrência grave."],["Está fechado entre Avenida 24 de Julho e Rua Dom Luís I - Fechada devido a obras na estrada."],["Em Calcada Da Quintinha - Ramal de entrada fechado. Obras de construção."],["Está fechado entre Rua de São Pedro de Alcântara e Rua da Conceição da Glória - Fechada devido a obras na estrada."],["Está fechado entre Rua Vasco da Gama Fernandes e Rua Luis Sá - Fechada devido a obras na estrada."]]}],"articles":[{"content":"Antigo sócio de Berardo diz que Fundação é uma “fachada” - Jornal de Negócios - Portugal Francisco Capelo, antigo sócio do empresário Joe Berardo, garante, em carta aos deputados e a que o Expresso teve acesso, que os bancos conhecem desde 2012 os riscos das obras de arte que estão em exposição no Centro Cultural de Belém."},{"content":"ABOLA.PT - Liga dos Campeões - Entrada na fase de grupos garante €43M ao Benfica; FC Porto pode chegar aos €44M - A Bola A BOLA, toda a informação desportiva. Acompanhe todas as notícias do seu clube ou modalidade preferida, para onde quer que vá."},{"content":"Rulli ganha força para a baliza do FC Porto - Record Antena 1 garante que já existe entendimento entre os clubes"},{"content":"Caso EDP. Ivo Rosa sofre 4.ª derrota no Tribunal da Relação de Lisboa – que elogia Carlos Alexandre - Observador "},{"content":"As imagens da tempestade mortal que atingiu a Grécia - Notícias ao Minuto Pelo menos sete pessoas perderam a vida."},{"content":"Leiria: incêndio em Alvaiázere em fase de rescaldo. A13 reaberta ao trânsito - PÚBLICO Comando Distrital de Operações de Socorro de Leiria garantiu que nenhuma habitação esteve em risco."},{"content":"Temos de “aceitar e respeitar as diferenças” porque somos todos diferentes, diz Marcelo - SAPO 24 O presidente da República, Marcelo Rebelo de Sousa, afirmou hoje em Palmela que os portugueses têm de \"aceitar e respeitar a diferença com abertura e tolerância\", durante uma visita ao Colégio Islâmico de Palmela."},{"content":"Interrogatório judicial aos arguidos da agência de viagens da Madeira prossegue amanhã - DNoticias Os dois arguidos, responsáveis de uma agência de viagens do Funchal, vão continuar a ser ouvidos amanhã, sexta-feira, em primeiro interrogatório judic..."},{"content":"Futebolista de 17 anos morre ao defender penálti com o peito - Correio da Manhã Jogador argentino Ramón Ismael Coronel pertencia ao Club Unión Golondrina Santa Fe."},{"content":"CFP: Administrações Públicas registam excedente orçamental de 179 milhões de euros no primeiro trimestre - Jornal Económico "},{"content":"Ministério Público quer levar 89 arguidos a julgamento no caso Hells Angels - SIC Notícias Foi hoje concluída a acusação do processo."},{"content":"Podcast Especial nos 50 anos da Viagem do Homem à Lua: Bem-vindos à Magnífica Desolação - Expresso “Magnífica Desolação”, afirmou o astronauta Buzz Aldrin ao ver a superfície lunar pela primeira vez a 20 de julho de 1969. Aldrin foi o segundo homem a pisar a Lua e fez parte da histórica tripulação da Apollo 11, juntamente com Neil Armstrong e Michael Colli…"},{"content":"Túmulos abertos no Vaticano para encontrar Emanuela Orlandi estão vazios - PÚBLICO Não há corpos dentro dos túmulos de duas princesas enterradas no século XIX. Autoridades continuaram a investigar as construções sobre o cemitério no Vaticano."},{"content":"Sonda japonesa pousa em asteróide a 244 milhões de quilómetros da Terra - ZAP Uma sonda espacial japonesa conseguiu pousar num asteróide localizado a 244 milhões de quilómetros da Terra, com o objetivo de..."},{"content":"Refrigerantes e sumos naturais com açúcar provocam cancro - Notícias ao Minuto Peritos franceses encontraram uma ligação entre o consumo diário de bebidas açucaradas ou sumos naturais de frutas com o aumento do risco de desenvolver cancro, revela hoje a revista British Medical Journal."},{"content":"Copo de sumo aumenta risco de cancro - Mundo - RTP O consumo excessivo de açúcar origina um aumento do risco de cancro, especialmente o da mama, de acordo com um novo estudo agora revelado. Reduzir a ..."},{"content":"O que é que aconteceu ao relvado do Estádio da Luz? - Sol Durante o jogo de apresentação 2019/20 do Benfica foi possível ver um relvado em muito más condições. O relvado foi mudado este ano. Mas o que é que terá acontecido para o relvado estar em péssimas condições?"},{"content":"Vem aí: Segredo de Marina é quase descoberto - TVI Amar Depois de Amar"},{"content":"Quem é a vizinha da Apple que vai comprar a WeDo? - ECO Economia Online A Mobileum \"vive\" junto a Apple, na Califórnia, e prepara-se para desembolsar mais de 70 milhões de dólares pela portuguesa WeDo Technologies. Mas que empresa é esta?"},{"content":"Watch: vulnerabilidade leva à suspensão da app Walkie-Talkie - Pplware A Apple descobriu uma lacuna de segurança na app Walkie-Talkie do seu Apple Watch, tendo procedido à desativação da mesma até que a situação seja resolvida."}]}